<!-- add-pr-comment:add-pr-comment -->

## plan
```
[0m[1mmodule.create_short_url_lambda.data.archive_file.lambda: Reading...[0m[0m
[0m[1mmodule.create_short_url_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1][0m
[0m[1mdata.aws_vpc.default: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.assume_dax_role: Reading...[0m[0m
[0m[1mmodule.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.assume_dax_role: Read complete after 0s [id=1279192937][0m
[0m[1maws_dynamodb_table.urls: Refreshing state... [id=urls][0m
[0m[1mmodule.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455][0m
[0m[1maws_api_gateway_rest_api.url_shortener_api: Refreshing state... [id=rf6e6y3ehg][0m
[0m[1maws_api_gateway_resource.redirect_resource: Refreshing state... [id=wzvks8][0m
[0m[1mmodule.post_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-rf6e6y3ehg-ygfswfv00b-POST][0m
[0m[1mdata.aws_iam_policy_document.create_short_url_lambda: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.allow_get_url: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.create_short_url_lambda: Read complete after 0s [id=2348542042][0m
[0m[1mdata.aws_iam_policy_document.allow_get_url: Read complete after 0s [id=2656050270][0m
[0m[1mmodule.create_short_url_lambda.data.aws_iam_policy_document.policies: Reading...[0m[0m
[0m[1mmodule.create_short_url_lambda.data.aws_iam_policy_document.policies: Read complete after 0s [id=2339330249][0m
[0m[1mmodule.create_short_url_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=create-short-url-lambda-role][0m
[0m[1mmodule.redirect_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-rf6e6y3ehg-wzvks8-GET][0m
[0m[1mdata.aws_vpc.default: Read complete after 1s [id=vpc-0e8781f4039da6cd0][0m
[0m[1mdata.aws_security_group.default_security_group: Reading...[0m[0m
[0m[1mdata.aws_subnets.default_vpc: Reading...[0m[0m
[0m[1mmodule.create_short_url_lambda.aws_lambda_function.lambda: Refreshing state... [id=create-short-url][0m
[0m[1mdata.aws_subnets.default_vpc: Read complete after 0s [id=us-east-1][0m
[0m[1mdata.aws_security_group.default_security_group: Read complete after 0s [id=sg-0d8ad6a826e7e21f6][0m
[0m[1mmodule.redirect_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=redirect-lambda-role][0m
[0m[1mmodule.post_url_method.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway][0m
[0m[1mmodule.post_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-rf6e6y3ehg-ygfswfv00b-POST][0m
[0m[1mmodule.redirect_lambda.aws_lambda_function.lambda: Refreshing state... [id=redirect][0m
[0m[1mmodule.redirect_url_method.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway][0m
[0m[1mmodule.redirect_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-rf6e6y3ehg-wzvks8-GET][0m
[0m[1maws_api_gateway_deployment.url_shortener_api_deployment: Refreshing state... [id=daxehr][0m
[0m[1maws_api_gateway_stage.live: Refreshing state... [id=ags-rf6e6y3ehg-live][0m
[0m[1maws_api_gateway_usage_plan.usage: Refreshing state... [id=j9n7k4][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.aws_iam_policy_document.allow_get_url_lambda[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "allow_get_url_lambda" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "dax:Query",
              [32m+[0m[0m "dynamodb:GetItem",
              [32m+[0m[0m "dynamodb:Query",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = [
              [32m+[0m[0m "arn:aws:dynamodb:us-east-1:692735942459:table/urls",
              [32m+[0m[0m "arn:aws:dynamodb:us-east-1:692735942459:table/urls/index/CodeIndex",
              [32m+[0m[0m (known after apply),
            ]
        }
    }

[1m  # aws_dax_cluster.urls[0m will be created
[0m  [32m+[0m[0m resource "aws_dax_cluster" "urls" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m cluster_address        = (known after apply)
      [32m+[0m[0m cluster_name           = "urls"
      [32m+[0m[0m configuration_endpoint = (known after apply)
      [32m+[0m[0m iam_role_arn           = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m maintenance_window     = (known after apply)
      [32m+[0m[0m node_type              = "dax.t3.small"
      [32m+[0m[0m nodes                  = (known after apply)
      [32m+[0m[0m parameter_group_name   = (known after apply)
      [32m+[0m[0m port                   = (known after apply)
      [32m+[0m[0m replication_factor     = 1
      [32m+[0m[0m security_group_ids     = [
          [32m+[0m[0m "sg-0d8ad6a826e7e21f6",
        ]
      [32m+[0m[0m subnet_group_name      = "default"
      [32m+[0m[0m tags_all               = (known after apply)
    }

[1m  # aws_iam_role.dax[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "dax" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "dax.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "urls-dax-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy {
          [32m+[0m[0m name   = "DefaultPolicy"
          [32m+[0m[0m policy = jsonencode(
                {
                  [32m+[0m[0m Statement = [
                      [32m+[0m[0m {
                          [32m+[0m[0m Action   = [
                              [32m+[0m[0m "dynamodb:UpdateItem",
                              [32m+[0m[0m "dynamodb:Scan",
                              [32m+[0m[0m "dynamodb:Query",
                              [32m+[0m[0m "dynamodb:PutItem",
                              [32m+[0m[0m "dynamodb:GetItem",
                              [32m+[0m[0m "dynamodb:DescribeTable",
                              [32m+[0m[0m "dynamodb:DeleteItem",
                              [32m+[0m[0m "dynamodb:ConditionCheckItem",
                              [32m+[0m[0m "dynamodb:BatchWriteItem",
                              [32m+[0m[0m "dynamodb:BatchGetItem",
                            ]
                          [32m+[0m[0m Effect   = "Allow"
                          [32m+[0m[0m Resource = [
                              [32m+[0m[0m "arn:aws:dynamodb:us-east-1:692735942459:table/urls/index/CodeIndex",
                              [32m+[0m[0m "arn:aws:dynamodb:us-east-1:692735942459:table/urls",
                            ]
                        },
                    ]
                  [32m+[0m[0m Version   = "2012-10-17"
                }
            )
        }
    }

[1m  # module.create_short_url_lambda.aws_iam_role.iam_for_lambda[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_iam_role" "iam_for_lambda" {
        id                    = "create-short-url-lambda-role"
        name                  = "create-short-url-lambda-role"
        tags                  = {}
        [90m# (12 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m inline_policy {
          [31m-[0m[0m name   = "DefaultPolicy" [90m-> null[0m[0m
          [31m-[0m[0m policy = jsonencode(
                {
                  [31m-[0m[0m Statement = [
                      [31m-[0m[0m {
                          [31m-[0m[0m Action   = [
                              [31m-[0m[0m "logs:PutLogEvents",
                              [31m-[0m[0m "logs:CreateLogStream",
                              [31m-[0m[0m "logs:CreateLogGroup",
                            ]
                          [31m-[0m[0m Effect   = "Allow"
                          [31m-[0m[0m Resource = "arn:aws:logs:*:*:*"
                          [31m-[0m[0m Sid      = "LogToCloudwatch"
                        },
                      [31m-[0m[0m {
                          [31m-[0m[0m Action   = "dynamodb:PutItem"
                          [31m-[0m[0m Effect   = "Allow"
                          [31m-[0m[0m Resource = "arn:aws:dynamodb:us-east-1:692735942459:table/urls"
                        },
                    ]
                  [31m-[0m[0m Version   = "2012-10-17"
                }
            ) [90m-> null[0m[0m
        }
      [32m+[0m[0m inline_policy {
          [32m+[0m[0m name   = "DefaultPolicy"
          [32m+[0m[0m policy = jsonencode(
                {
                  [32m+[0m[0m Statement = [
                      [32m+[0m[0m {
                          [32m+[0m[0m Action   = [
                              [32m+[0m[0m "logs:PutLogEvents",
                              [32m+[0m[0m "logs:CreateLogStream",
                              [32m+[0m[0m "logs:CreateLogGroup",
                            ]
                          [32m+[0m[0m Effect   = "Allow"
                          [32m+[0m[0m Resource = "arn:aws:logs:*:*:*"
                          [32m+[0m[0m Sid      = "LogToCloudwatch"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m Action   = [
                              [32m+[0m[0m "ec2:DescribeNetworkInterfaces",
                              [32m+[0m[0m "ec2:DescribeInstances",
                              [32m+[0m[0m "ec2:DeleteNetworkInterface",
                              [32m+[0m[0m "ec2:CreateNetworkInterface",
                              [32m+[0m[0m "ec2:AttachNetworkInterface",
                            ]
                          [32m+[0m[0m Effect   = "Allow"
                          [32m+[0m[0m Resource = "*"
                          [32m+[0m[0m Sid      = "VPCPermissions"
                        },
                      [32m+[0m[0m {
                          [32m+[0m[0m Action   = "dynamodb:PutItem"
                          [32m+[0m[0m Effect   = "Allow"
                          [32m+[0m[0m Resource = "arn:aws:dynamodb:us-east-1:692735942459:table/urls"
                        },
                    ]
                  [32m+[0m[0m Version   = "2012-10-17"
                }
            )
        }
    }

[1m  # module.create_short_url_lambda.aws_lambda_function.lambda[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "lambda" {
        id                             = "create-short-url"
        tags                           = {}
        [90m# (28 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m environment {
          [33m~[0m[0m variables = {
              [33m~[0m[0m "BASE_URL" = "https://yr9q6b5bjc.execute-api.us-east-1.amazonaws.com/live/" [33m->[0m[0m [90mnull[0m[0m
            }
        }

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1m  # module.redirect_lambda.data.archive_file.lambda[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "archive_file" "lambda" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m output_base64sha256 = (known after apply)
      [32m+[0m[0m output_base64sha512 = (known after apply)
      [32m+[0m[0m output_md5          = (known after apply)
      [32m+[0m[0m output_path         = "redirect_lambda_function_payload.zip"
      [32m+[0m[0m output_sha          = (known after apply)
      [32m+[0m[0m output_sha256       = (known after apply)
      [32m+[0m[0m output_sha512       = (known after apply)
      [32m+[0m[0m output_size         = (known after apply)
      [32m+[0m[0m source_file         = "./init/index.mjs"
      [32m+[0m[0m type                = "zip"
    }

[1m  # module.redirect_lambda.data.aws_iam_policy_document.assume_role[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "assume_role" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions = [
              [32m+[0m[0m "sts:AssumeRole",
            ]
          [32m+[0m[0m effect  = "Allow"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "lambda.amazonaws.com",
                ]
              [32m+[0m[0m type        = "Service"
            }
        }
    }

[1m  # module.redirect_lambda.data.aws_iam_policy_document.policies[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "policies" {
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m json                      = (known after apply)
      [32m+[0m[0m minified_json             = (known after apply)
      [32m+[0m[0m override_policy_documents = [
          [32m+[0m[0m (known after apply),
        ]

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "logs:CreateLogGroup",
              [32m+[0m[0m "logs:CreateLogStream",
              [32m+[0m[0m "logs:PutLogEvents",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = [
              [32m+[0m[0m "arn:aws:logs:*:*:*",
            ]
          [32m+[0m[0m sid       = "LogToCloudwatch"
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "ec2:AttachNetworkInterface",
              [32m+[0m[0m "ec2:CreateNetworkInterface",
              [32m+[0m[0m "ec2:DeleteNetworkInterface",
              [32m+[0m[0m "ec2:DescribeInstances",
              [32m+[0m[0m "ec2:DescribeNetworkInterfaces",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "VPCPermissions"
        }
    }

[1m  # module.redirect_lambda.aws_iam_role.iam_for_lambda[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_iam_role" "iam_for_lambda" {
      [33m~[0m[0m assume_role_policy    = jsonencode(
            {
              [31m-[0m[0m Statement = [
                  [31m-[0m[0m {
                      [31m-[0m[0m Action    = "sts:AssumeRole"
                      [31m-[0m[0m Effect    = "Allow"
                      [31m-[0m[0m Principal = {
                          [31m-[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [31m-[0m[0m Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "redirect-lambda-role"
        name                  = "redirect-lambda-role"
        tags                  = {}
        [90m# (11 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m inline_policy {
          [31m-[0m[0m name   = "DefaultPolicy" [90m-> null[0m[0m
          [31m-[0m[0m policy = jsonencode(
                {
                  [31m-[0m[0m Statement = [
                      [31m-[0m[0m {
                          [31m-[0m[0m Action   = [
                              [31m-[0m[0m "logs:PutLogEvents",
                              [31m-[0m[0m "logs:CreateLogStream",
                              [31m-[0m[0m "logs:CreateLogGroup",
                            ]
                          [31m-[0m[0m Effect   = "Allow"
                          [31m-[0m[0m Resource = "arn:aws:logs:*:*:*"
                          [31m-[0m[0m Sid      = "LogToCloudwatch"
                        },
                      [31m-[0m[0m {
                          [31m-[0m[0m Action   = [
                              [31m-[0m[0m "dynamodb:Query",
                              [31m-[0m[0m "dynamodb:GetItem",
                              [31m-[0m[0m "dax:Query",
                            ]
                          [31m-[0m[0m Effect   = "Allow"
                          [31m-[0m[0m Resource = [
                              [31m-[0m[0m "arn:aws:dynamodb:us-east-1:692735942459:table/urls/index/*",
                              [31m-[0m[0m "arn:aws:dynamodb:us-east-1:692735942459:table/urls",
                            ]
                        },
                    ]
                  [31m-[0m[0m Version   = "2012-10-17"
                }
            ) [90m-> null[0m[0m
        }
      [32m+[0m[0m inline_policy {
          [32m+[0m[0m name   = "DefaultPolicy"
          [32m+[0m[0m policy = (known after apply)
        }
    }

[1m  # module.redirect_lambda.aws_lambda_function.lambda[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lambda_function" "lambda" {
        id                             = "redirect"
        tags                           = {}
        [90m# (28 unchanged attributes hidden)[0m[0m

      [32m+[0m[0m vpc_config {
          [32m+[0m[0m ipv6_allowed_for_dual_stack = false
          [32m+[0m[0m security_group_ids          = [
              [32m+[0m[0m "sg-0d8ad6a826e7e21f6",
            ]
          [32m+[0m[0m subnet_ids                  = [
              [32m+[0m[0m "subnet-06b20a3a5dbd3837c",
            ]
        }

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 2 to add, 4 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"

```   
#magic___^_^___line